In [2]:
import pandas as pd

In [3]:
import numpy as np

### Bad Way

In [4]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]

In [5]:
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

In [6]:
pop = pd.Series(populations, index=index)

In [7]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [8]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [9]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

### The Better Way: Pandas MultiIndex

In [10]:
index = pd.MultiIndex.from_tuples(index)

In [11]:
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [12]:
pop = pop.reindex(index)

In [13]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [14]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

### MultiIndex as extra dimension

In [15]:
pop_df = pop.unstack()

In [16]:
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [17]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [18]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})

In [19]:
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [20]:
f_u18 = pop_df['under18'] / pop_df['total']

In [21]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

### MultiIndex Creation

In [22]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])

In [23]:
df

        data1     data2
a 1  0.404845  0.730638
  2  0.762199  0.778963
b 1  0.160414  0.690079
  2  0.241566  0.308841

In [24]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}

In [25]:
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

### Explicit MultiIndex constructors

In [26]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [27]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [28]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [31]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [32]:
pop.index.names = ['state', 'year']

In [33]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [34]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names = ['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names = ['subject', 'type'])

In [41]:
data = np.round(np.random.randn(4, 6), 1)
data

array([[-0.7,  0.5,  0.3, -0.7, -0.3, -1.9],
       [-0. ,  0.8, -1.6, -1.3, -0. ,  1.3],
       [ 1.2,  0.4,  0.1,  0.3,  0.9,  1. ],
       [-1.7, -0.9,  0. ,  0. , -0.5,  0. ]])

In [42]:
data[:, ::2] *= 10
data += 37

In [43]:
data

array([[30. , 37.5, 40. , 36.3, 34. , 35.1],
       [37. , 37.8, 21. , 35.7, 37. , 38.3],
       [49. , 37.4, 38. , 37.3, 46. , 38. ],
       [20. , 36.1, 37. , 37. , 32. , 37. ]])

In [44]:
health_data = pd.DataFrame(data, index=index, columns=columns)

In [45]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  37.5  40.0  36.3  34.0  35.1
     2      37.0  37.8  21.0  35.7  37.0  38.3
2014 1      49.0  37.4  38.0  37.3  46.0  38.0
     2      20.0  36.1  37.0  37.0  32.0  37.0

In [46]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [47]:
pop['California', 2000]

33871648

In [48]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [49]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [50]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [51]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [52]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [53]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  37.5  40.0  36.3  34.0  35.1
     2      37.0  37.8  21.0  35.7  37.0  38.3
2014 1      49.0  37.4  38.0  37.3  46.0  38.0
     2      20.0  36.1  37.0  37.0  32.0  37.0

In [54]:
health_data['Guido', 'HR']

year  visit
2013  1        40.0
      2        21.0
2014  1        38.0
      2        37.0
Name: (Guido, HR), dtype: float64

In [55]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      30.0  37.5
     2      37.0  37.8

In [58]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        30.0
      2        37.0
2014  1        49.0
      2        20.0
Name: (Bob, HR), dtype: float64

In [59]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (3311942670.py, line 1)

In [60]:
idx = pd.IndexSlice

In [61]:
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      30.0  40.0  34.0
2014 1      49.0  38.0  46.0

In [62]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])

In [63]:
data = pd.Series(np.random.rand(6), index=index)

In [64]:
data.index.names = ['char', 'int']

In [65]:
data

char  int
a     1      0.349111
      2      0.565751
c     1      0.398353
      2      0.037740
b     1      0.815889
      2      0.476269
dtype: float64

In [66]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [67]:
data = data.sort_index()

In [68]:
data

char  int
a     1      0.349111
      2      0.565751
b     1      0.815889
      2      0.476269
c     1      0.398353
      2      0.037740
dtype: float64

In [69]:
data['a':'b']

char  int
a     1      0.349111
      2      0.565751
b     1      0.815889
      2      0.476269
dtype: float64

### from a stacked multi-index to a simple two-dimensional representation

In [71]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [70]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [72]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [73]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### turn the index labels into columns

In [74]:
pop_flat = pop.reset_index(name='population')

In [75]:
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [76]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### Data Aggregations

In [77]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  37.5  40.0  36.3  34.0  35.1
     2      37.0  37.8  21.0  35.7  37.0  38.3
2014 1      49.0  37.4  38.0  37.3  46.0  38.0
     2      20.0  36.1  37.0  37.0  32.0  37.0

In [78]:
data_mean = health_data.mean(level='year')

/var/folders/2c/5n1ds71d3v35fmncr8yhbwzm0000gn/T/ipykernel_1467/872640225.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean = health_data.mean(level='year')

In [80]:
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     33.5  37.65  30.5  36.00  35.5  36.7
2014     34.5  36.75  37.5  37.15  39.0  37.5

In [84]:
data_mean.mean(axis=1, level='type')

/var/folders/2c/5n1ds71d3v35fmncr8yhbwzm0000gn/T/ipykernel_1467/1641729190.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  33.166667  36.783333
2014  37.000000  37.133333

In [85]:
health_data.groupby(level='year').mean()

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     33.5  37.65  30.5  36.00  35.5  36.7
2014     34.5  36.75  37.5  37.15  39.0  37.5

In [90]:
data_mean.groupby(axis=1, level='type').mean()

type         HR       Temp
year
2013  33.166667  36.783333
2014  37.000000  37.133333